# -*- coding: UTF-8 -*-
# 条件语句.  别忘记冒号！
'''
#----------------------------
if ( var  == 100 ) : print "变量 var 的值为100" 
#----------------------------
if 判断条件：
    执行语句……
#----------------------------
if 判断条件：
    执行语句……
else：
    执行语句……
#----------------------------
if 判断条件1:
    执行语句1……
elif 判断条件2:
    执行语句2……
elif 判断条件3:
    执行语句3……
else:
    执行语句4……
#----------------------------
'''


# 循环语句
'''
#----------------------------
while 判断条件：
    执行语句……
#----------------------------
while 判断条件:
   执行语句……
else:
   执行语句……
#----------------------------
for循环可以遍历任何序列的项目，如一个列表或者一个字符串
for iterating_var in sequence:
   statements(s)

for letter in 'Python':     # 第一个实例
   print '当前字母 :', letter

通过索引
fruits = ['banana', 'apple',  'mango']
for index in range(len(fruits)):
   print '当前水果 :', fruits[index]
#----------------------------
for iterating_var in sequence:
   执行语句……
else:
   执行语句……
#----------------------------
break： 用于终止循环
#----------------------------
continue：结束本次循环，然后继续进行下一轮循环。
#----------------------------
Python pass是空语句，是为了保持程序结构的完整性。
pass 不做任何事情，一般用做占位语句。

# 输出 Python 的每个字母
for letter in 'Python':
   if letter == 'h':
      pass
      print '这是 pass 块'
   print '当前字母 :', letter

print "Good bye!"
#----------------------------
'''